---
kind: property
id: P:Autodesk.Revit.DB.CylindricalSurface.Axis
zh: 轴、x轴、y轴、z轴
source: html/d477d77b-1381-2cf6-638c-c21553679422.htm
---
# Autodesk.Revit.DB.CylindricalSurface.Axis Property

**中文**: 轴、x轴、y轴、z轴

Axis of the cylinder. This is the Z axis of the local coordinate system associated with this cylinder.

## Syntax (C#)
```csharp
public XYZ Axis { get; }
```